In [71]:
import pandas as pd

In [77]:
df=pd.read_csv('BlackFriday.csv')

In [79]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Purchase
0,1000001,P00069042,F,0-17,10.0,A,2,0.0,3.0,8370.0
1,1000001,P00248942,F,0-17,10.0,A,2,0.0,1.0,15200.0
2,1000001,P00087842,F,0-17,10.0,A,2,0.0,12.0,1422.0
3,1000001,P00085442,F,0-17,10.0,A,2,0.0,12.0,1057.0
4,1000002,P00285442,M,55+,16.0,C,4+,0.0,8.0,7969.0

In [10]:
df.shape

(286691, 12)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286691 entries, 0 to 286690
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     286691 non-null  int64
 1   Product_ID                  286690 non-null  object
 2   Gender                      286690 non-null  object
 3   Age                         286690 non-null  object
 4   Occupation                  286690 non-null  float64
 5   City_Category               286690 non-null  object
 6   Stay_In_Current_City_Years  286690 non-null  object
 7   Marital_Status              286690 non-null  float64
 8   Product_Category_1          286690 non-null  float64
 9   Product_Category_2          197859 non-null  float64
 10  Product_Category_3          87885 non-null   float64
 11  Purchase                    286690 non-null  float64
dtypes: float64(6), int64(1), object(5)
memory usage: 26.2+ MB

In [14]:
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10.0,A,2,0.0,3.0,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10.0,A,2,0.0,1.0,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10.0,A,2,0.0,12.0,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10.0,A,2,0.0,12.0,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16.0,C,4+,0.0,8.0,NaN,NaN,7969.0
...,...,...,...,...,...,...,...,...,...,...,...,...
286686,1002095,P00240042,M,55+,13.0,C,1,1.0,5.0,NaN,NaN,5208.0
286687,1002095,P00252042,M,55+,13.0,C,1,1.0,5.0,14.0,NaN,7180.0
286688,1002096,P00233442,F,26-35,17.0,C,1,1.0,1.0,2.0,15.0,15789.0
286689,1002096,P00208342,F,26-35,17.0,C,1,1.0,1.0,16.0,NaN,19660.0
286690,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
df.isnull()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,False,False,False,False,False,False,False,False,False,True,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,True,True,False
3,False,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,True,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
286686,False,False,False,False,False,False,False,False,False,True,True,False
286687,False,False,False,False,False,False,False,False,False,False,True,False
286688,False,False,False,False,False,False,False,False,False,False,False,False
286689,False,False,False,False,False,False,False,False,False,False,True,False
286690,False,True,True,True,True,True,True,True,True,True,True,True

In [18]:
df.isnull().sum()

User_ID                            0
Product_ID                         1
Gender                             1
Age                                1
Occupation                         1
City_Category                      1
Stay_In_Current_City_Years         1
Marital_Status                     1
Product_Category_1                 1
Product_Category_2             88832
Product_Category_3            198806
Purchase                           1
dtype: int64

In [20]:
df['User_ID'].nunique()

5892

In [22]:
df['Product_ID'].nunique()

3523

In [24]:
df['Gender'].unique()

array(['F', 'M', nan], dtype=object)

In [26]:
df['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25', nan],
      dtype=object)

In [28]:
df['Occupation'].unique()

array([10., 16., 15.,  7., 20.,  9.,  1., 12., 17.,  0.,  3.,  4., 11.,
        8., 19.,  2., 18.,  5., 14., 13.,  6., nan])

In [30]:
df['City_Category'].unique()

array(['A', 'C', 'B', nan], dtype=object)

In [32]:
df['Stay_In_Current_City_Years'].unique()

array(['2', '4+', '3', '1', '0', nan], dtype=object)

In [34]:
df['Marital_Status'].unique()

array([ 0.,  1., nan])

In [36]:
df['Product_Category_1'].unique()

array([ 3.,  1., 12.,  8.,  5.,  4.,  2.,  6., 14., 11., 13., 15.,  7.,
       16., 18., 10., 17.,  9., nan])

In [38]:
df['Purchase'].sum()/len(df['Purchase'])

9314.742719513344

In [40]:
for column in df.columns:
    print(column, ":" ,df[column].nunique())

User_ID : 5892
Product_ID : 3523
Gender : 2
Age : 7
Occupation : 21
City_Category : 3
Stay_In_Current_City_Years : 5
Marital_Status : 2
Product_Category_1 : 18
Product_Category_2 : 17
Product_Category_3 : 15
Purchase : 16650